# Найти корни квадратного уравнения Ax² + Bx + C = 0
# Математикой
# Используя дополнительные библиотеки*

a = 1
b = -6
c = 9

D = b**2 - 4*a*c
if D < 0:
    print('Корней нет')
if D == 0:
    x = (-b +- (D**0.5)) / (2*a)
    print(f'x = {x}')
if D > 0:
    x1 = (-b - (D**0.5)) / (2*a)
    x2 = (-b + (D**0.5)) / (2*a)
    print(f'x1 = {x1} \nx2 = {x2}')

