# 5. Написать программу вычисления значения функции y = f(a)

a = 2
y = a**3 + a*a + a
print(y)
