# 2. Даны два числа. Показать большее и меньшее число

a = 3
b = 3
if a > b:
    print(f'Большее число {a}, меньшее число {b}')
elif b > a:
    print('Большее число', b, 'меньшее число', a)
else:
    print('Числа равны')
